# 열 병합(좌우)

In [3]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','c1','c2','c3']},
                  index = [0,1,2,3])
df2 = pd.DataFrame({'a':['a2','a3','a4','a5'],
                   'b':['b2','b3','b4','b5'],
                   'c':['c2','c3','c4','c5'],
                   'd':['d2','d3','d4','d5']},
                   index = [2,3,4,5])
display(df1);display(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [6]:
df3=pd.concat([df1,df1],axis=1)
df3

    a   b   c   a   b   c
0  a0  b0  c0  a0  b0  c0
1  a1  b1  c1  a1  b1  c1
2  a2  b2  c2  a2  b2  c2
3  a3  b3  c3  a3  b3  c3

# 조건 데이터 추출

In [7]:
raw=pd.read_csv('./train.csv')

## 1) 조건 확인
####  2가지 똑같음

In [29]:
raw.loc[(raw['Age']>=20) & (raw['Sex']=='female'), ['Pclass','Survived']]

raw[(raw['Age']>=20) & (raw['Sex']=='female')][['Pclass','Survived']]

     Pclass  Survived
1         1         1
2         3         1
3         1         1
8         3         1
11        1         1
..      ...       ...
874       2         1
879       1         1
880       2         1
882       3         0
885       3         0

[186 rows x 2 columns]

# 2) 해당 값 대체

In [31]:
display(raw.loc[(raw['Age']>=20) & (raw['Sex']=='female'), 'Pclass'])

raw.loc[(raw['Age']>=20) & (raw['Sex']=='female'), 'Pclass']=999

display(raw.loc[(raw['Age']>=20) & (raw['Sex']=='female'), 'Pclass'])

1      999
2      999
3      999
8      999
11     999
      ...
874    999
879    999
880    999
882    999
885    999
Name: Pclass, Length: 186, dtype: int64

1      999
2      999
3      999
8      999
11     999
      ...
874    999
879    999
880    999
882    999
885    999
Name: Pclass, Length: 186, dtype: int64

# 기초통계량

#### 숫자형

In [8]:
raw.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### 문자형

In [9]:
raw.describe(include=['O'])

                          Name   Sex Ticket    Cabin Embarked
count                      891   891    891      204      889
unique                     891     2    681      147        3
top     Andrews, Mr. Thomas Jr  male   1601  B96 B98        S
freq                         1   577      7        4      644

# groupby

#### 그룹별 평균

In [11]:
raw[['Pclass','Survived']].groupby(['Pclass'],as_index=False).mean().sort_values(by='Survived',ascending=False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

#### 그룹별 데이터

In [15]:
grouped= raw[['Sex','Survived']].groupby(['Sex'],as_index=False)

for group_name, group_df in grouped:
    display(group_name)
    display(group_df)

'female'

        Sex  Survived
1    female         1
2    female         1
3    female         1
8    female         1
9    female         1
..      ...       ...
880  female         1
882  female         0
885  female         0
887  female         1
888  female         0

[314 rows x 2 columns]

'male'

      Sex  Survived
0    male         0
4    male         0
5    male         0
6    male         0
7    male         0
..    ...       ...
883  male         0
884  male         0
886  male         0
889  male         1
890  male         0

[577 rows x 2 columns]

# 문자형-> 숫자형

In [41]:
raw=pd.read_csv('./train.csv')

In [42]:
display(raw['Embarked'])

from collections import defaultdict

Embarked_mapping=defaultdict(int)
for i,t in enumerate(raw['Embarked'].unique()):
    Embarked_mapping[t]=i

raw['Embarked'] = raw['Embarked'].map(Embarked_mapping)
raw['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

0      0
1      1
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    1
890    2
Name: Embarked, Length: 891, dtype: int64